# IMPORT RELEVANT LIBRARIES

In [72]:
import pandas as pd
import numpy as np

In [44]:
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

# import required libraries for clustering
import sklearn
from sklearn.preprocessing import StandardScaler
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
from scipy.cluster.hierarchy import linkage
from scipy.cluster.hierarchy import dendrogram
from scipy.cluster.hierarchy import cut_tree

# HOW TO LOAD DATASET

In [73]:
df = pd.read_csv("OnlineRetail.csv", encoding="latin-1")
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

 # HOW TO GET SHAPE OF THE DATASET

In [46]:
df.shape

(541909, 8)

# HOW TO GET SIZE OF THE DATASET

In [47]:
df.size

4335272

# HOW TO GET HEAD OF THIS DATA

In [48]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

# HOW TO DESCRIBE THE DATA

In [49]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

# HOW TO GET INFORMATION ABOUT THE DATA

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

# HOW TO FIND NULL VALUES

In [51]:
df_null = df.isnull().sum()
df_null

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

#  HOW TO GET THE PERCENTAGES

In [52]:
df_null = round(100*(df.isnull().sum())/len(df),2)
df_null

InvoiceNo       0.00
StockCode       0.00
Description     0.27
Quantity        0.00
InvoiceDate     0.00
UnitPrice       0.00
CustomerID     24.93
Country         0.00
dtype: float64

# HOW TO DROP ROWS OF NULL VALUES

In [53]:
df=df.dropna()
df.shape

(406829, 8)

In [54]:
df['CustomerID'] = df['CustomerID'].astype(str)

/tmp/ipykernel_9797/2669915015.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['CustomerID'] = df['CustomerID'].astype(str)

# HOW TO DROP COLUMN

In [55]:
df = df.drop('StockCode',axis=1)

In [56]:
df.head()

,InvoiceNo,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

# HOW TO ADD A NEW COLUMN "AMOUNT"

In [74]:
df['Amount']=df['Quantity']*df['UnitPrice']
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France,10.20
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France,12.60
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France,16.60
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France,16.60
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France,14.85

# How to monitor dataset  and group by

In [58]:
df_montoring=df.groupby('CustomerID')["Amount"].sum()
df_montoring.head()

CustomerID
12346.0       0.00
12347.0    4310.00
12348.0    1797.24
12349.0    1757.55
12350.0     334.40
Name: Amount, dtype: float64

In [59]:
df['Amount']=df['Quantity']*df['UnitPrice']
df_montoring=df.groupby('CustomerID')["Amount"].sum()
df_montoring=df_montoring.reset_index()
df_montoring.head()

  CustomerID   Amount
0    12346.0     0.00
1    12347.0  4310.00
2    12348.0  1797.24
3    12349.0  1757.55
4    12350.0   334.40

In [60]:
monetary_df=df.groupby("CustomerID")["UnitPrice"].sum()
monetary_df=monetary_df.reset_index()
monetary_df.head()

  CustomerID  UnitPrice
0    12346.0       2.08
1    12347.0     481.21
2    12348.0     178.71
3    12349.0     605.10
4    12350.0      65.30

# How to find out most bought product

In [61]:
most_bought_product=df.groupby("Description")["Quantity"].sum()
most_bought_product=most_bought_product.reset_index()
most_bought_product.head()

                      Description  Quantity
0   4 PURPLE FLOCK DINNER CANDLES       140
1   50'S CHRISTMAS GIFT BAG LARGE      1883
2               DOLLY GIRL BEAKER      2391
3     I LOVE LONDON MINI BACKPACK       360
4     I LOVE LONDON MINI RUCKSACK         1

# How to find Country with large sales

In [62]:
region=df.groupby("Country")["Quantity"].sum()
region=region.reset_index()
region.head()

     Country  Quantity
0  Australia     83653
1    Austria      4827
2    Bahrain       260
3    Belgium     23152
4     Brazil       356

In [63]:
df_monitoring=df.groupby("Description")["InvoiceNo"].count()
df_monitoring=df_monitoring.reset_index()
df_monitoring.columns=['Description','Frequency']
df_monitoring.sort_values(by="Frequency", ascending=False)

                             Description  Frequency
3716  WHITE HANGING HEART T-LIGHT HOLDER       2070
2780            REGENCY CAKESTAND 3 TIER       1905
1771             JUMBO BAG RED RETROSPOT       1662
217        ASSORTED COLOUR BIRD ORNAMENT       1418
2355                       PARTY BUNTING       1416
...                                  ...        ...
453   BLUE NEW BAROQUE FLOCK CANDLESTICK          1
1720          IVORY SHELL HEART EARRINGS          1
457          BLUE PAINTED KASHMIRI CHAIR          1
1712          IVORY PANTRY HANGING LAMP           1
2067                    MINT DINER CLOCK          1

[3896 rows x 2 columns]

# How fromat invoice date dataset into date and time

In [77]:
df['InvoiceDate']=pd.to_datetime(df["InvoiceDate"], format= '%m/%d/%Y %H:%M')
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France,10.20
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France,12.60
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France,16.60
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France,16.60
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France,14.85

# Find out the maximum and minimum date in the dataset

In [78]:
max_date=max(df["InvoiceDate"])
max_date

Timestamp('2011-12-09 12:50:00')

In [66]:
min_date=min(df["InvoiceDate"])
min_date

Timestamp('2010-12-01 08:26:00')

In [67]:
df= max_date - min_date
df

Timedelta('373 days 04:24:00')

In [79]:
from datetime import timedelta

one_month_ago=max_date-timedelta(days=30)
last_month_df=df[df['InvoiceDate'] >= one_month_ago]
total_sales_last_month=last_month_df['Amount'].sum()
total_sales_last_month

1497279.68